###############################################################################
# Created by write_sdc
# Sun Feb 26 05:51:47 2023
###############################################################################
current_design shiftreg
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sclk -period 24.0000 [get_ports {sclk}]
set_clock_transition 0.1500 [get_clocks {sclk}]
set_clock_uncertainty 0.2500 sclk
set_propagated_clock [get_clocks {sclk}]
set_input_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {latch}]
set_input_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {sdin}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {sr_out}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gy[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_series_gygy[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[6]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt[7]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s1_shunt_gy[6]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[6]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gy[7]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[6]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_series_gygy[7]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[10]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[4]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[5]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[6]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[7]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[8]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt[9]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt_gy[0]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt_gy[1]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt_gy[2]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt_gy[3]}]
set_output_delay 4.8000 -clock [get_clocks {sclk}] -add_delay [get_ports {tune_s2_shunt_gy[4]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {sr_out}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gy[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_series_gygy[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[7]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[6]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[6]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s1_shunt_gy[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[7]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[6]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gy[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[7]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[6]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_series_gygy[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[10]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[9]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[8]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[7]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[6]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[5]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt[0]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt_gy[4]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt_gy[3]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt_gy[2]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt_gy[1]}]
set_load -pin_load 0.0729 [get_ports {tune_s2_shunt_gy[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {latch}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sclk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sdin}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 100.0000 [current_design]
